Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState
The Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState class manages a short lived state on a System.Windows.Controls.Control.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.ShortStateDuration
The default duration of a short lived state, in milliseconds.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.ErrorColor
The System.Windows.Media.Color to set as Control.BackColor for Tekla.BIM.DirectManipulation.Services.Controls.ControlShortState.Error.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.HighlightColor
The System.Windows.Media.Color to set as Control.BackColor for Tekla.BIM.DirectManipulation.Services.Controls.ControlShortState.Highlight.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.shortStateTimer
The System.Timers.Timer managing the lifetime of the state.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.toolarBarControl
The System.Windows.Controls.Control to apply the short lived state on.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.shortState
The short lived state to apply on Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.toolarBarControl.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.originalBackColor
The original System.Windows.Media.Color value set as Control.BackColor on Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.toolarBarControl.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.#ctor(System.Windows.Controls.Control,Tekla.BIM.DirectManipulation.Services.Controls.ControlShortState)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState class.
toolBarControl: The System.Windows.Controls.Control to apply the short lived state on.
shortState: The Tekla.BIM.DirectManipulation.Services.Controls.ControlShortState to apply on toolBarControl.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.Ended
Occurs when the state has ended.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.ToolBarControl
Gets the System.Windows.Controls.Control affected by the short lived state.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.State
Gets the Tekla.BIM.DirectManipulation.Services.Controls.ControlShortState to apply as a short lived state on System.Windows.Controls.Control.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.Active
Gets a value indicating whether the current state is active.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.End
Ends the state.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.Renew
Resets the state's lifetime.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.Start
Starts the state.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.Dispose
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.OnStateEnded(System.Object,System.EventArgs)
Handles any event indicating that the state must be ended.
sender: The sender of the event, expected to be either Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.shortStateTimer or Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.ToolBarControl.
eventArgs: The arguments of the event.